
## Plan Result




<pre><code>Plan: 12 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS-SOURCE2
  * azurerm_key_vault_secret.POSTGRES-USER-SOURCE2
  * azurerm_key_vault_secret.POSTGRES_DATABASE-SOURCE2
  * azurerm_key_vault_secret.POSTGRES_HOST-SOURCE2
  * module.flexible_database_source2.azurerm_postgresql_flexible_server.pgsql_server
  * module.flexible_database_source2.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.flexible_database_source2.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.flexible_database_source2.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.flexible_database_source2.azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]
  * module.flexible_database_source2.azurerm_resource_group.rg[0]
  * module.flexible_database_source2.null_resource.set-user-permissions-additionaldbs[&#34;toffee&#34;]
  * module.flexible_database_source2.random_password.password
* Update
  * module.single_database_source.azurerm_postgresql_server.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS-SOURCE2 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-SOURCE2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-PASS-SOURCE2"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-SOURCE2 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-SOURCE2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-USER-SOURCE2"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE-SOURCE2 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE-SOURCE2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-DATABASE-SOURCE2"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-SOURCE2 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST-SOURCE2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-shared-infrastructure-stg/providers/Microsoft.KeyVault/vaults/toffeesi-stg"
      + name                    = "recipe-backend-POSTGRES-HOST-SOURCE2"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.flexible_database_source2.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "toffee-v14-flexible-source2-stg"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "toffee-v14-flexible-source2-data-stg"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.flexible_database_source2.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "toffee-v14-flexible-source2-data-stg"
      + server_name         = "toffee-v14-flexible-source2-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.flexible_database_source2.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "toffee-v14-flexible-source2-data-stg"
      + server_name         = "toffee-v14-flexible-source2-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.flexible_database_source2.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.flexible_database_source2.azurerm_postgresql_flexible_server_database.pg_databases["toffee"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "toffee"
      + server_id = (known after apply)
    }

  # module.flexible_database_source2.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "toffee-v14-flexible-source2-data-stg"
      + tags     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
    }

  # module.flexible_database_source2.null_resource.set-user-permissions-additionaldbs["toffee"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "toffee-v14-flexible-source2"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.flexible_database_source2.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.single_database_source.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v11-source-data-stg/providers/Microsoft.DBforPostgreSQL/servers/toffee-v11-source-stg"
        name                              = "toffee-v11-source-stg"
        tags                              = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":351,"Program":"tfcmt","SHA1":"","Vars":{}} -->